In [2]:
import math
import collections

import numpy as np
import pandas as pd
import matplotlib.pyplot as pp

%matplotlib inline

In [3]:
pd.options.display.max_rows = 8

In [4]:
allyears = pd.read_csv('allyears.csv.gz')

In [6]:
allyears_by_year = allyears.set_index(['sex','year']).sort_index()
allyears_by_year

               name  number
sex year
F   1880       Mary    7065
    1880       Anna    2604
    1880       Emma    2003
    1880  Elizabeth    1939
...             ...     ...
M   2018      Zyran       5
    2018      Zyrie       5
    2018      Zyron       5
    2018      Zzyzx       5

[1957046 rows x 2 columns]

In [7]:
allyears_by_year.loc['M',2018].sort_values('number',ascending = False)

             name  number
sex year
M   2018     Liam   19837
    2018     Noah   18267
    2018  William   14516
    2018    James   13525
...           ...     ...
    2018   Gavynn       5
    2018    Gavon       5
    2018   Gaurav       5
    2018    Zzyzx       5

[14004 rows x 2 columns]

In [11]:
allyears_by_year.loc['M',2018].sort_values('number',ascending = False).head(10)

             name  number
sex year
M   2018     Liam   19837
    2018     Noah   18267
    2018  William   14516
    2018    James   13525
...           ...     ...
    2018   Elijah   12886
    2018    Lucas   12585
    2018    Mason   12435
    2018    Logan   12352

[10 rows x 2 columns]

In [13]:
allyears_by_year.loc['F',2018].sort_values('number',ascending = False).head(10)

              name  number
sex year
F   2018      Emma   18688
    2018    Olivia   17921
    2018       Ava   14924
    2018  Isabella   14464
...            ...     ...
    2018       Mia   12642
    2018    Amelia   12301
    2018    Harper   10582
    2018    Evelyn   10376

[10 rows x 2 columns]

In [15]:
allyears_by_year.loc['F',2018].sort_values('number',ascending = False).head(10).reset_index().name

0        Emma
1      Olivia
2         Ava
3    Isabella
       ...
6         Mia
7      Amelia
8      Harper
9      Evelyn
Name: name, Length: 10, dtype: object

In [18]:
"palindrome"[::-2]

'eodia'

In [19]:
np.linspace(0,6,3)

array([0., 3., 6.])

In [20]:
dogs = {'Fred':'Coolie','Alex':'Beagle','Ella':'Boxer'}

'Alex' in dogs

True

In [23]:
for r in range(4,12,3):
    print(r)

4
7
10

In [24]:
'\n Franklin \n'.strip()

'Franklin'